Repository: Raf-Comp/test
Catalog: languages/ai-chat-assistant-*.po
Languages: pl_pl

source: Load More
pl_pl: Załaduj więcej

source: Clear History
pl_pl: Wyczyść historię

source: Are you sure you want to clear this chat history?
pl_pl: Czy na pewno chcesz wyczyścić historię czatu?

source: Select a session to view history
pl_pl: Wybierz sesję, aby zobaczyć historię

source: Error loading session:
pl_pl: Błąd ładowania sesji:

source: Error clearing history:
pl_pl: Błąd czyszczenia historii:

source: Chat History
pl_pl: Historia czatu

source: No chat sessions found.
pl_pl: Nie znaleziono sesji czatu.

source: Loading...
pl_pl: Ładowanie...

source: Error:
pl_pl: Błąd:

source: Success:
pl_pl: Sukces:

source: Are you sure you want to delete this session?
pl_pl: Czy na pewno chcesz usunąć tę sesję?

source: Session deleted successfully.
pl_pl: Sesja została pomyślnie usunięta.

source: Error deleting session:
pl_pl: Błąd usuwania sesji:

source: Conversation exported successfully.
pl_pl: Konwersacja została pomyślnie wyeksportowana.

source: Error exporting conversation:
pl_pl: Błąd eksportowania konwersacji:

source: Conversation duplicated successfully.
pl_pl: Konwersacja została pomyślnie zduplikowana.

source: Error duplicating conversation:
pl_pl: Błąd duplikowania konwersacji:

source: AI Chat Assistant Settings
pl_pl: Ustawienia Asystenta Czatu AI

source: Settings saved successfully.
pl_pl: Ustawienia zostały pomyślnie zapisane.

source: API Settings
pl_pl: Ustawienia API

source: Claude API Key
pl_pl: Klucz API Claude

source: Toggle password visibility
pl_pl: Przełącz widoczność hasła

source: Test Connection
pl_pl: Testuj połączenie

source: GitHub Token
pl_pl: Token GitHub

source: GitLab Token
pl_pl: Token GitLab

source: Bitbucket Token
pl_pl: Token Bitbucket

source: Interface Settings
pl_pl: Ustawienia interfejsu

source: Theme
pl_pl: Motyw

source: Light
pl_pl: Jasny

source: Dark
pl_pl: Ciemny

source: System
pl_pl: Systemowy

source: Message History Limit
pl_pl: Limit historii wiadomości

source: Maximum number of messages to keep in history.
pl_pl: Maksymalna liczba wiadomości do przechowywania w historii.

source: Manage Repositories
pl_pl: Zarządzanie repozytoriami

source: Sources
pl_pl: Źródła

source: Saved Repositories
pl_pl: Zapisane repozytoria

source: Language Filters
pl_pl: Filtry języka

source: Search repositories...
pl_pl: Szukaj repozytoriów...

source: Name (A-Z)
pl_pl: Nazwa (A-Z)

source: Name (Z-A)
pl_pl: Nazwa (Z-A)

source: Newest
pl_pl: Najnowsze

source: Oldest
pl_pl: Najstarsze

source: Toggle dark/light mode
pl_pl: Przełącz tryb ciemny/jasny

source: Add Repository
pl_pl: Dodaj repozytorium

source: No saved repositories
pl_pl: Brak zapisanych repozytoriów

source: You don't have any saved repositories yet. Add your first repository.
pl_pl: Nie masz jeszcze żadnych zapisanych repozytoriów. Dodaj swoje pierwsze repozytorium.

source: Browse Files
pl_pl: Przeglądaj pliki

source: Refresh Metadata
pl_pl: Odśwież metadane

source: Delete Repository
pl_pl: Usuń repozytorium

source: Type:
pl_pl: Typ:

source: Added:
pl_pl: Dodano:

source: Languages:
pl_pl: Języki:

source: Open in
pl_pl: Otwórz w

source: No GitHub Repositories
pl_pl: Brak repozytoriów GitHub

source: No repositories found in your GitHub account.
pl_pl: Nie znaleziono żadnych repozytoriów w Twoim koncie GitHub.

source: Check Settings
pl_pl: Sprawdź ustawienia

source: Last Update:
pl_pl: Ostatnia aktualizacja:

source: Main Language:
pl_pl: Główny język:

source: Open in GitHub
pl_pl: Otwórz w GitHub

source: Add
pl_pl: Dodaj

source: No GitLab Repositories
pl_pl: Brak repozytoriów GitLab

source: No repositories found in your GitLab account.
pl_pl: Nie znaleziono żadnych repozytoriów w Twoim koncie GitLab.

source: Open in GitLab
pl_pl: Otwórz w GitLab

source: No Bitbucket Repositories
pl_pl: Brak repozytoriów Bitbucket

source: No repositories found in your Bitbucket account.
pl_pl: Nie znaleziono żadnych repozytoriów w Twoim koncie Bitbucket.

source: Open in Bitbucket
pl_pl: Otwórz w Bitbucket

source: File Browser
pl_pl: Przeglądarka plików

source: Search files...
pl_pl: Szukaj plików...

source: Loading files...
pl_pl: Ładowanie plików...

source: Copy
pl_pl: Kopiuj

source: Use in Chat
pl_pl: Użyj w czacie

source: Loading content...
pl_pl: Ładowanie zawartości...

source: Delete Confirmation
pl_pl: Potwierdzenie usunięcia

source: Are you sure you want to delete repository
pl_pl: Czy na pewno chcesz usunąć repozytorium

source: This operation is irreversible.
pl_pl: Ta operacja jest nieodwracalna.

source: Cancel
pl_pl: Anuluj

source: Delete
pl_pl: Usuń

source: Success
pl_pl: Sukces

source: Error
pl_pl: Błąd

source: Warning
pl_pl: Ostrzeżenie

source: Information
pl_pl: Informacja

source: Claude API key is not configured.
pl_pl: Klucz API Claude nie jest skonfigurowany.

source: ClaudeClient class does not exist.
pl_pl: Klasa ClaudeClient nie istnieje.

source: Connection to Claude API is not working.
pl_pl: Połączenie z API Claude nie działa.

source: Selected Claude model is not available.
pl_pl: Wybrany model Claude nie jest dostępny.

source: GitHub token is not configured.
pl_pl: Token GitHub nie jest skonfigurowany.

source: GitHubClient class does not exist.
pl_pl: Klasa GitHubClient nie istnieje.

source: Connection to GitHub API is not working.
pl_pl: Połączenie z API GitHub nie działa.

source: GitLab token is not configured.
pl_pl: Token GitLab nie jest skonfigurowany.

source: Connection to GitLab API is not working.
pl_pl: Połączenie z API GitLab nie działa.

source: Bitbucket credentials are not configured.
pl_pl: Dane dostępowe Bitbucket nie są skonfigurowane.

source: Connection to Bitbucket API is not working.
pl_pl: Połączenie z API Bitbucket nie działa.

source: Missing %d out of %d required database tables. Use the "Repair" button in the "Database Status" section.
pl_pl: Brakuje %d z %d wymaganych tabel w bazie danych. Użyj przycisku "Napraw" w sekcji "Status bazy danych".

source: Missing file: %s (%s)
pl_pl: Brakuje pliku: %s (%s)

source: File is not readable: %s (%s)
pl_pl: Plik nie jest czytelny: %s (%s)

source: Configure Claude API key in plugin settings.
pl_pl: Skonfiguruj klucz API Claude w ustawieniach wtyczki.

source: Configure GitHub token in plugin settings.
pl_pl: Skonfiguruj token GitHub w ustawieniach wtyczki.

source: Configure GitLab token in plugin settings.
pl_pl: Skonfiguruj token GitLab w ustawieniach wtyczki.

source: Configure Bitbucket credentials in plugin settings.
pl_pl: Skonfiguruj dane dostępowe Bitbucket w ustawieniach wtyczki.
